In [1]:
import pandas as pd
bio_data = {'성명' : ['이겨레', '조약돌'],
            '나이' : [25, 19],
            '성별' : ['남','여'],
            '키' : [185, 163],
            '체중' : [89, 53]}
df = pd.DataFrame(bio_data)
df

    성명  나이 성별    키  체중
0  이겨레  25  남  185  89
1  조약돌  19  여  163  53

In [2]:
df['BMI'] = 0
df

    성명  나이 성별    키  체중  BMI
0  이겨레  25  남  185  89    0
1  조약돌  19  여  163  53    0

In [3]:
import pandas as pd
bio_data = {'성명' : ['이겨레', '조약돌'],
            '나이' : [25, 19],
            '성별' : ['남','여'],
            '키' : [185, 163],
            '체중' : [89, 53]}
df = pd.DataFrame(bio_data)
df

    성명  나이 성별    키  체중
0  이겨레  25  남  185  89
1  조약돌  19  여  163  53

In [4]:
df.loc[2] = 0
df

    성명  나이 성별    키  체중
0  이겨레  25  남  185  89
1  조약돌  19  여  163  53
2    0   0  0    0   0

In [5]:
df.loc[3] = ['강산에', 27, '남', 177, 63]
df

    성명  나이 성별    키  체중
0  이겨레  25  남  185  89
1  조약돌  19  여  163  53
2    0   0  0    0   0
3  강산에  27  남  177  63

In [6]:
df.loc['추가'] = df.loc[2]
df

     성명  나이 성별    키  체중
0   이겨레  25  남  185  89
1   조약돌  19  여  163  53
2     0   0  0    0   0
3   강산에  27  남  177  63
추가    0   0  0    0   0

In [7]:
df.set_index('성명', inplace=True)
df

     나이 성별    키  체중
성명
이겨레  25  남  185  89
조약돌  19  여  163  53
0     0  0    0   0
강산에  27  남  177  63
0     0  0    0   0

In [8]:
target_01 = df.loc['이겨레', '키']
target_01

185

In [9]:
target_02 = df.iloc[0, 2]
target_02

185

In [10]:
import pandas as pd
bio_data = {'성명' : ['이겨레', '조약돌'],
            '나이' : [25, 19],
            '성별' : ['남','여'],
            '키' : [185, 163],
            '체중' : [89, 53]}
df = pd.DataFrame(bio_data)
df

    성명  나이 성별    키  체중
0  이겨레  25  남  185  89
1  조약돌  19  여  163  53

In [11]:
df.set_index('성명', inplace=True)
df

     나이 성별    키  체중
성명
이겨레  25  남  185  89
조약돌  19  여  163  53

In [12]:
target_01 = df.loc['이겨레', ['키', '체중']]
target_01

키     185
체중     89
Name: 이겨레, dtype: object

In [13]:
target_02 = df.iloc[0, [2, 3]]
target_02

키     185
체중     89
Name: 이겨레, dtype: object

In [14]:
target_03 = df.loc['이겨레', '키' : '체중']
target_03

키     185
체중     89
Name: 이겨레, dtype: object

In [15]:
target_04 = df.iloc[0, 2:]
target_04

키     185
체중     89
Name: 이겨레, dtype: object

In [16]:
import pandas as pd
bio_data = {'성명' : ['이겨레', '조약돌'],
            '나이' : [25, 19],
            '성별' : ['남','여'],
            '키' : [185, 163],
            '체중' : [89, 53]}
df = pd.DataFrame(bio_data)
df

    성명  나이 성별    키  체중
0  이겨레  25  남  185  89
1  조약돌  19  여  163  53

In [17]:
df.set_index('성명', inplace=True)
df

     나이 성별    키  체중
성명
이겨레  25  남  185  89
조약돌  19  여  163  53

In [18]:
target_01 = df.loc[['이겨레', '조약돌'], ['키', '체중']]
target_01

       키  체중
성명
이겨레  185  89
조약돌  163  53

In [19]:
target_02 = df.iloc[[0, 1], [2, 3]]
target_02

       키  체중
성명
이겨레  185  89
조약돌  163  53

In [20]:
target_03 = df.loc['이겨레' : '조약돌', '키' : '체중']
target_03

       키  체중
성명
이겨레  185  89
조약돌  163  53

In [21]:
target_04 = df.iloc[0:2, 2:]
target_04

       키  체중
성명
이겨레  185  89
조약돌  163  53

In [22]:
# end